<?php
/* @var $this yii\web\View */

$this->title = 'Админка EQ';
?>
<div class="site-index">

    <div class="jumbotron">
        <h1>Поздравляем!</h1>

        <p class="lead">Вы в числе избранных. Здесь происходит управление всеми ресурсами эквилибриума.</p>
    </div>

    <div class="body-content">

        <div class="row">
            <div class="col-lg-4">
                <h2>Статьи</h2>

                <p>Статьи - это основной контент, который не только несёт полезную информацию нашим посетителям, но
                    и поднимает наш сайт в выдачев поисковых систем. Убедительная просьба уделять особое внимание
                    орфографии, стилистике и, конечно, уникальности текста. И не забывайте о лаконичном форматировании,
                    не
                    играйте со шрифтами и размерами.
                </p>

                <p><a class="btn btn-default" href="https://www.etxt.ru/antiplagiat/" target="_blank">Антиплагиат »</a>
                </p>
            </div>
            <div class="col-lg-4">
                <h2>Мероприятия</h2>

                <p>В этом разделе мы размещаем анонсы различных событий в мире рок-музыки и с тематикой близкой к этому.
                    Размещайте здесь только информацию о реально запланированных мероприятиях, предварительно проверяя
                    достоверность предоставленных вам данных. И всё ещё не забываем об уникальности контента
                </p>
            </div>
            <div class="col-lg-4">
                <h2>Последнее напутствие</h2>

                <p>
                    Если уж вы оказались здесь, значит вам оказана честь творить историю нашего ресурса вместе с нами.
                    Не пытайтесь кого-то оскорбить или дискредитировать с помощью вашего контента. Нам не нужны конфликтные
                    ситуации. Поэтому: пис, братья и да прибудет с вами сила!
                </p>
                </p>
            </div>
        </div>

    </div>
</div>
